//
//  DuaDataManager.swift
//  YUSUR
//
//  Created by shaden  on 13/06/1446 AH.
//
import SwiftData

@MainActor
class DuaDataManager {
    static func seedDuaDataIfNeeded(context: ModelContext) {
            let initialDuas = [
                // الإحرام
                Dua(arabicText: "لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك، لا شريك لك.", category: "الإحرام"),
                
                // الطواف
                Dua(arabicText: "يختم كل شوط بقوله: رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ", category: "الطواف"),
                Dua(arabicText: "سبحان الله والحمد لله ولا إله إلا الله والله أكبر.", category: "الطواف"),
                Dua(arabicText: "اللهم إنك عفو كريم تحب العفو فاعف عني.", category: "الطواف"),
                Dua(arabicText: "اللهم إني أسألك العفو والعافية في الدنيا والآخرة.", category: "الطواف"),
                
                // السعي
                Dua(arabicText: "الله أكبر، الله أكبر، الله أكبر، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، لا إله إلا الله وحده، أنجز وعده، ونصر عبده، وهزم الأحزاب وحده.", category: "السعي"),
                Dua(arabicText: "اللهم إنك عفوٌ كريمٌ تحب العفو فاعفُ عني.", category: "السعي"),
                Dua(arabicText: "لا إله إلا الله، وحده لا شريك له، له الملك، وله الحمد، يحيي ويميت وهو على كل شيء قدير، لا إله إلا الله وحده أنجز وعده، ونصر عبده، وهزم الأحزاب وحده.", category: "السعي"),
                Dua(arabicText: "للَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي، فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ.", category: "السعي"),
                
                // التحلل من الإحرام
                Dua(arabicText: "ٱللَّهُمَّ ٱجْعَلْنِي مِنَ ٱلْمَقْبُولِينَ فِي ٱلدُّنْيَا وَٱلْآخِرَةِ، وَٱغْفِرْ لِي وَلِوَالِدَيَّ وَلِجَمِيعِ ٱلْمُسْلِمِينَ.", category: "التحلل من الإحرام"),
                Dua(arabicText: "ٱللَّهُمَّ ٱرْزُقْنِي زِيَارَةَ بَيْتِكَ ٱلْحَرَامِ مَرَّةً أُخْرَىٰ، وَبَارِكْ لِي فِي حَيَاتِي، وَوَفِّقْنِي لِمَا تُحِبُّ وَتَرْضَىٰ.", category: "التحلل من الإحرام"),
                Dua(arabicText: "ٱللَّهُمَّ لَكَ ٱلْحَمْدُ عَلَىٰ تَمَامِ ٱلنِّعْمَةِ وَكَمَالِ ٱلْفَضْلِ، ٱللَّهُمَّ ٱجْعَلْنِي مِمَّنْ رَضِيتَ عَنْهُمْ، وَغَفَرْتَ لَهُمْ، وَكَتَبْتَ لَهُمْ أَجْرَ ٱلْعُمْرَةِ كَامِلَةً.", category: "التحلل من الإحرام"),
                Dua(arabicText: "اللّهُـمَّ لَـكَ الحَـمْـدُ، أنْـتَ جَـمَّلْتَ خَلْقِي، وَزَيَّنْـتَ شَعْرِي، فَاجْعَلْهُ لِي طَهَارَةً وَبَرَكَةً، وَاغْفِرْ لِي ذُنُوبِي، وَتَقَبَّلْ عِبَادَتِي.", category: "التحلل من الإحرام")
            ]
            
            for dua in initialDuas {
                context.insert(dua) // Add each Dua to the context
            }
            
            try? context.save() // Save the data
        }
    }

